{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [512, 83]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [83]}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "lstm_1/kernel", "shape": [83, 2048]}, {"dtype": "float32", "name": "lstm_1/recurrent_kernel", "shape": [512, 2048]}, {"dtype": "float32", "name": "lstm_1/bias", "shape": [2048]}], "paths": ["group2-shard1of2", "group2-shard2of2"]}], "modelTopology": {"keras_version": "2.1.6", "training_config": {"loss": "categorical_crossentropy", "sample_weight_mode": null, "optimizer_config": {"class_name": "RMSprop", "config": {"lr": 0.0010000000474974513, "epsilon": 1e-07, "rho": 0.8999999761581421, "decay": 0.0}}, "metrics": [], "loss_weights": null}, "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_regularizer": null, "return_sequences": false, "trainable": true, "batch_input_shape": [null, 40, 83], "unit_forget_bias": true, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "bias_constraint": null, "implementation": 1, "stateful": false, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "recurrent_regularizer": null, "return_state": false, "recurrent_constraint": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "units": 83, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}}}